# 데이터 생성 후 연습 3

# ----------------------------------------------
# Time-series 의 역차분
# ----------------------------------------------

dd <- matrix(
  data = c(
    c(1342, 1442, 1252, 1343),
    c(1425, 1362, 1456, 1272),
    c(1243, 1359, 1412, 1253),
    c(1201, 1478, 1322, 1406),
    c(1254, 1289, 1497, 1205)
  )
) 
dd
( dd.ts <- ts(data = dd, frequency = 4, start = c(2006, 1)) ) # 분기 데이터 생성.

dd.ts

# 내가 원하는 데이터 추출법 
dd.ts[1,1] # R에선 인덱스 번호 1부터 시작.


# -----------------------------------------------
# (1) 1시차, 1차분 수행
# -----------------------------------------------
( dd1.ts <- diff(dd.ts, lag = 1, differences = 1) ) # lag는 주기에 맞춰서. (여기선 1분기임.) # 추세성분 제거
# 차분하면 사라지기 때문에, 역차분해야함. 복구하고싶을 때.
# -----------------------------------------------
# (2) 1시차, 1역차분 수행
# -----------------------------------------------
( dd2.ts <- diffinv(dd1.ts, lag = 1, differences = 1) ) #  
# -----------------------------------------------
# (3) 역차분된 time-series object + Original time-series's first Yt
#    --> 
# -----------------------------------------------
dd.ts
dd.ts[1,1] # 1342

( dd1.ts <- diff(dd.ts, lag = 1, differences = 1) )
( dd2.ts <- diffinv(dd1.ts, lag = 1, differences = 1) )
dd2.ts + 1342  # 역차분한값에 1342 더해주면 원래 시계열값복구 
