-- sample4mine.sql

-- 1. 자동 형변환 (묵시적 형변환) - Promotion

--      <NUMBER> <--> <CHARACTER> <--> <DATE>
--      문자타입과 숫자타입, 문자타입과 데이트 타입으로 자동으로 형변환 가능.
--      강제 형변환 (명시적 형변환) - Casting

-- 2. 강제 형변환 (명시적 형변환) - Casting

-- (1) <NUMBER>     -- TO CHAR      --> <CHARACTER>
--      <CHARACTER> -- TO_ NUMBER   --> <NUMBER>
-- (2) <CHARACTER>  -- TO_DATE

-- 여기 필기안함.
--------------------------------------------------------
DESC employees; --> 숫자 타입임을 확인.

SELECT last_name, salary
FROM employees
WHERE salary = '17000' --> 오라클 엔진이 자동으로 왼쪽은 숫자타입, 오른쪽은 문자타입인데, 문자 안에 들어있는게 숫자네 ? 그럼 자동형변환 됨.

-- -------------------------------------------------------------------
-- (4) 변환 (처리)함수 - TO_CHAR
-- -------------------------------------------------------------------
-- 1. 날짜 데이터를 문자 데이터로 변환
--    예 : TO_CHAR( hire_date, 'YYYY') 
-- -------------------------------------------------------------------
SELECT to_char(sysdate, 'YYYY/MM/DD,(AM) DAY HH24:MI:SS') --> 이게 뭘 의미하는지는 다 책에 나와있음.
FROM dual;

SELECT last_name, hire_date, salary
FROM employees
WHERE to_char(hire_date, 'MM') = '09'; --> 채용일자가 9월인 직원을 뽑아내라.

SELECT to_char(sysdate, ' YYYY "년" MM "월 DD "일" ') AS 날짜 --> 전체는 문자열로 해놓고, 쌍따옴표는 기능이 정해져 있음.
FROM dual;
-- -------------------------------------------------------------------
-- 2. 숫자 데이터를 문자 데이터로 변환
--    예 : TO_CHAR( 123456, '999,999')
-- -------------------------------------------------------------------

-- 1) 숫자 출력형식
SELECT 
    to_char(1234, '99999') AS "99999"
    to_char(1234, '099999') AS "099999"
--여기 하다 말음

-- 2) 화폐 출력형식
SELECT 
    last_name,
    salary,
    to_char(salary, '$999,999') 달러, --> 세자리마다 표시해주고, 달라를 붙여주어라. --> 이미 NLS에서 미국으로 지정되어있긴 함. 이거 바꿔주면 됨.
    to_char(salary, 'L999,999') 원화  
FROM
    employees;
-- ----------------------------------------------------------------------
-- (4) 변환 (처리)함수 - TO_NUMBER
-- --------------------------------------------------------------------
-- 문자 데이터를 숫자로 변환 ... 
-- ---------------------------------------------------------------------
SELECT
    to_number('123') + 100,         -- 강제형변환(Casting)  --> 문자를 숫자로 변환 시켰으니,,
    '456' + 100,                    -- 자동형변환(Promotion) -- > 오라클에선 +가 두 숫자를 더해주는 기능만 있음. 오라클이 자동으로 형변환해줌.
    to_char(123) || '456',          -- 강제형변환(Casting)    --> 문자열로 표시됨 !!
    123 || '456'                    -- 강제형변환(Promotion) --> 문자열 연결 연산자이니까 
FROM
    dual;
-- ------------------------------------------------------
-- (4) 변환 (처리)함수 - TO_DATE
-- ------------------------------------------------------
-- '날짜형태'의 문자 데이터를 날짜 데이터로 변환
-- ------------------------------------------------------

-- 1) To change Oracle's default date format
--    * Oracle SQL*Developer 에서도 수행해볼 것!
-- -------------------------------------------------------
ALTER SESSION SET NLS_DATE_FORMAT='RR/MM/DD';
ALTER SESSION SET NLS_DATE_FORMAT='YYYY/MM/DD HH24:MI:SS';

SELECT sysdate
FROM dual;


-- 2) to_date 응용
SELECT to_date('20170802181030', 'YYYYMMDDHH24MISS')  --> 왼쪽에 날짜 형식의 문자열이 들어오고, 오른쪽으로 날짜로 변환시켜줌 !!
FROM dual;

SELECT
    sysdate,
    sysdate - to_date('20170101', 'YYYYMMDD')
FROM
    dual;