-- sample1.sql

-- -------------------------------------------------------------------------
--  여기 필기 못함

-- *************************************************************************
-- - Clauses  -                           - 실행순서 -
--
-- SELECT clause                              (5)
-- FROM clause                                (1)
-- WHERE clause                               (2)
-- GROUP BY clause                            (3)
-- HAVING clause                              (4)
-- ORDER BY clause                            (6)
-- **************************************************************************

-- -------------------------------------------------------------------------
--              ** SELECT 문의 기본문법 구조 ***
 -- 여기 필기하지말고 올려준거 받자
-- -------------------------------------------------------------------------
-- 1. To project all columns of the table  # 모든 컬럼 한방에 선택 !!
-- 여기 이런 필기 잘 안함, 나중에 한번에 옮겨쓰기. HR계정으로 !!
-- -------------------------------------------------------------------------
SELECT *  -- 이 *를 와일드카드 문자 라고 한다.
FROM employees; 

SELECT *
FROM departments;

-- -------------------------------------------------------------------------
-- 2. To project only~~ # 원하는 것만 나열하기~~~
-- -------------------------------------------------------------------------
--
--
-- -------------------------------------------------------------------------
SELECT employee_id, last_name, hire_date, SALARY
FROM employees;                                                 -- # 소문자로 된거 인지하기.

-- -------------------------------------------------------------------------
-- 3. 산술연산자의 활용 (+, ~~) # 언어니까 산술연산자 가능, SELECT 
-- -------------------------------------------------------------------------
-- SELECT column1 
-- -------------------------------------------------------------------------
SELECT salary, salary + 100 FROM employees;
SELECT salary, salary - 100 FROM employees;
SELECT salary, salary * 100 FROM employees;
SELECT salary, salary / 100 FROM employees;

SELECT last_name, salary, salary * 12  -- 여긴 salary가 숫자라서 가능했는데, 이름은 !? - 안됨.
FROM employees;

-- -------------------------------------------------------------------------
-- 4. About SYS.DUAL table  # SYS 계정의 DUAL테이블 
-- -------------------------------------------------------------------------
SELECT 245 * 567  
FROM dual;  -- 위에 SELECT 절에서 사용하는 문장이 숫자열 같이 FROM 절 테이블 부르는게 필요 없을 때 사용하는게 dual !! 
            -- 참고로, 
DESC sys.dual;
DESC dual; -- 굳이 소유자 계정 기재하지 않아도 됨.

--SELECT~~~ 어쩌구 명령어 안씀
-- ---------------------------------------------------------------------------