# ---------------------------------------------------
# Time-series object 의 역차분(inverse difference)
# ---------------------------------------------------
# (1) 차분된 time-series object 를, 원래의 time-series object로
#     환원
# (2) Yt = (delta)Yt + Yt-1
#
# (3) 사용함수: diffinv() 함수(매개변수는 diff()함수와 동일)
#

dd.ts               # Original time-series object
dd.ts[1,1]          # Matrix[1,1] : 가장 첫번째 자료


# ---------------------------------------------------
# (1) 1시차, 1차분 수행
# ---------------------------------------------------
( dd1.ts <- diff(dd.ts, lag = 1, differences = 1) )   # 1 시차, 1차분


# ---------------------------------------------------
# (2) 1시차, 1역차분 수행
# ---------------------------------------------------
( dd2.ts <- diffinv(dd1.ts, lag = 1, differences = 1))   # dd1.ts 역차분


# ---------------------------------------------------
# (3) 역차분된 time-series object + Original time-series's first Yt
#     => Original time-series object
# ---------------------------------------------------
dd2.ts + dd.ts[1,1]

